<template>
  <div>
    <h1>CCBOT - 用户协议 （草案）</h1>
    <p>首先，欢迎来到CCBOT。</p>
    <p>
      请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入 CCBOT。当您正式注册 CCBOT 后，您在本站（即「CCBOT」）中的所有活动都必须遵守以下条款。除非您已阅读并接受本协议所有条款，否则您无权使用
      CCBOT 提供的任何服务。
    </p>
    <h4>1. 用户账号</h4>
    <ol>
      <li>
        CCBOT 帐号的所有权归 CCBOT 所有，用户完成申请注册手续后，仅获得 CCBOT 帐号的使用权，且该使用权仅属于初始申请注册人。同时，初始申请注册人不得赠与、借用、租用、转让或售卖 CCBOT
        帐号或者以其他方式许可非初始申请注册人使用 CCBOT 帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用 CCBOT 帐号。
      </li>
      <li>用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。当在您怀疑他人在使用您的帐号时，请及时告知 CCBOT。</li>
      <li>
        用户须对在 CCBOT 的注册信息的真实性、合法性、有效性承担全部责任，用户不得冒充他人；不得利用他人的名义发布任何信息；不得恶意使用注册帐号导致其他用户误认；否则 CCBOT
        有权立即停止提供服务，收回其帐号并由用户独自承担由此而产生的一切法律责任。
      </li>
      <li>在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方是否可信，并请经常留意有关防范诈骗犯罪的提示。</li>
      <li>用户注册 CCBOT 帐号后如果连续超过一年（365天）不登录该帐号，CCBOT 有权回收该帐号，以免造成资源浪费，由此带来的任何损失均由用户自行承担。</li>
    </ol>
    <h4>2. 用户发表的内容</h4>
    <ol>
      <li>用户对任何信息的发表即认可该信息为公开的信息，并单独对此行为承担法律责任；任何用户不愿被其他第三人获知的信息都不应该在 CCBOT 上进行发表。</li>
      <li>用户直接或通过各类方式（如站外 API 引用等）间接使用 CCBOT 服务和数据的行为，都将被视作已无条件接受本协议全部内容；若用户对本协议的任何条款存在异议，请停止使用 CCBOT 所提供的全部服务。</li>
      <li>用户承诺不得以任何方式利用 CCBOT 直接或间接从事违反中国法律以及社会公德的行为，CCBOT 有权对违反上述承诺的内容予以删除。</li>
      <li>
        用户不得利用 CCBOT 服务制作、上载、复制、发布、传播或者转载如下内容：
        <ol>
          <li>
            违反国家法律法规禁止的内容：
            <ol>
              <li>反对宪法所确定的基本原则</li>
              <li>危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一，损害国家荣誉和利益</li>
              <li>侮辱、滥用英烈形象，歪曲、丑化、亵渎、否定英雄烈士事迹和精神，以侮辱、诽谤或者其他方式侵害英雄烈士的姓名、肖像、名誉、荣誉</li>
              <li>宣扬恐怖主义、极端主义或者煽动实施恐怖活动、极端主义活动</li>
              <li>煽动民族仇恨、民族歧视，破坏民族团结</li>
              <li>破坏国家宗教政策，宣扬邪教和封建迷信</li>
              <li>散布谣言，扰乱社会秩序，破坏社会稳定</li>
              <li>宣扬淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪</li>
              <li>煽动非法集会、结社、游行、示威、聚众扰乱社会秩序</li>
              <li>侮辱或者诽谤他人，侵害他人名誉、隐私和其他合法权益</li>
              <li>含有法律、行政法规禁止的其他内容</li>
            </ol>
          </li>
          <li>侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；</li>
          <li>涉及他人隐私、个人信息或资料的；</li>
          <li>骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的；</li>
          <li>其他违反法律法规、政策及公序良俗、社会公德或干扰 CCBOT 正常运营和侵犯其他用户或第三方合法权益内容的信息。</li>
        </ol>
      </li>
      <li>
        CCBOT 有权对用户使用 CCBOT 的情况进行审查和监督，如用户在使用 CCBOT 时违反任何上述规定，CCBOT
        或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容、暂停或终止用户使用 CCBOT 的权利）以减轻用户不当行为造成的影响。
      </li>
    </ol>
    <h4>3. 用户数据</h4>
    <ul>
      <li>
        CCBOT 将会尽其合理努力保障您在本站的数据存储安全，但是，CCBOT 并不能就此提供完全保证，包括但不限于以下情形：
        <ol>
          <li>CCBOT 不对您在本站相关数据的删除或储存失败负责；</li>
          <li>CCBOT 有权根据实际情况自行决定单个用户在本站中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。您可根据自己的需要自行备份本站中的相关数据；</li>
          <li>如果您停止使用本站（注销账号），CCBOT 可以从服务器上永久地删除您的数据。主动停止使用本站后，CCBOT 没有义务向您返还任何数据。</li>
          <li>如果因其他原因导致服务被终止或取消，CCBOT 仅对您的数据提供一个月（31天）的保留期。保留期到期后，CCBOT 可以从服务器上永久地删除您的数据。</li>
        </ol>
      </li>
      <li>
        用户在使用本站时，须自行承担如下来自 CCBOT 不可掌控的风险内容，包括但不限于：
        <ol>
          <li>由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；</li>
          <li>第三方网站及相关内容所可能导致的风险，由第三方网站和用户承担；</li>
          <li>用户发布的内容被他人转发、分享，因此等传播可能带来的风险和责任；</li>
          <li>由于无线网络信号不稳定、无线网络带宽小等原因所引起的风险。</li>
        </ol>
      </li>
    </ul>
    <h4>4. 第三方应用和服务</h4>
    <ol>
      <li>
        您在使用本站第三方提供的应用或服务时，除遵守本协议约定外，还应向第三方了解并遵守其用户协议。第三方提供的应用并非由 CCBOT 开发或维护，CCBOT 无法对第三方应用导致的问题或损害承担责任。CCBOT
        和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。
      </li>
      <li>
        因用户使用本站或要求 CCBOT 提供特定服务时，本站可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供，CCBOT
        不保证通过第三方提供应用及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与 CCBOT 无关，CCBOT 不承担任何责任。
      </li>
      <li>CCBOT 有权决定将本站作商业用途，包括但不限于开发、使用本站的部分服务为第三方作推广等，CCBOT 承诺在推广过程中严格按照本协议约定保护你的个人信息，同时你亦可以根据系统设置选择屏蔽、拒绝接收相关推广信息。</li>
    </ol>
    <h4>5. 协议修改</h4>
    <ul>
      <li>
        根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，CCBOT 有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，CCBOT 将会直接在本站上公布修改之后的协议内容，该公布行为视为 CCBOT
        已经通知用户修改内容。CCBOT 也可采用电子邮件的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。
      </li>
      <li>如果不同意 CCBOT 对本协议相关条款所做的修改，用户有权并应当停止使用 CCBOT。如果用户继续使用 CCBOT，则视为用户接受 CCBOT 对本协议相关条款所做的修改。</li>
    </ul>
    <blockquote>
      <p>CCBOT 2020 修订日期：2020/3/3</p>
    </blockquote>
  </div>
</template>